Revit 2026 API

# UIControlledApplicationLoadAddIn Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void LoadAddIn(
	string fileName
)
```
```vb
Public Sub LoadAddIn (
	fileName As String
)
```
```cpp
public:
void LoadAddIn(
	String^ fileName
)
```
```fsharp
member LoadAddIn :
        fileName : string -> unit
```

#### Parameters

fileName String

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace